In [1]:
# Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
# DataFrame with a new index that starts from 1 and increments by 2 for each row.?

In [13]:
import pandas as pd
data={"A":"hello","B":"hello","C":"hello"}
df=pd.DataFrame(data,index=[5,3,1])
df_reindex=df.reindex([1,3,5])
print(df_reindex)

       A      B      C
1  hello  hello  hello
3  hello  hello  hello
5  hello  hello  hello

In [14]:
# Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
# iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
# function should print the sum to the console.

In [28]:
import pandas as ps
data={"Values":[10,20,30,40,50,60]}
df=ps.DataFrame(data)
df1=df[0:3]
print(df1)
df1.sum()

   Values
0      10
1      20
2      30

Values    60
dtype: int64

In [89]:
# Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
# 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [3]:
import pandas as ps
data1={"Text":["neelam rahul","rahul neelam","mahi love","assu","renu"]}
df=ps.DataFrame(data1)
df["Word_Count"]=df["Text"].apply(lambda n:len(n.split()))
print(df)

           Text  Word_Count
0  neelam rahul           2
1  rahul neelam           2
2     mahi love           2
3          assu           1
4          renu           1

In [110]:
# Q5. How are DataFrame.size() and DataFrame.shape() different?
# Syntax: dataframe.size
# Return : Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.
# Syntax: dataframe.shape
# Return : Returns tuple of shape (Rows, columns) of dataframe/series

In [111]:
# Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
# addresses in the format 'username@domain.com'. Write a Python function that creates a new column
# 'Username' in df that contains only the username part of each email address.
# The username is the part of the email address that appears before the '@' symbol. For example, if the
# email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your
# function should extract the username from each email address and store it in the new 'Username'
# column.

In [2]:
import pandas as ps
data3={"email":["neelam@gamil.com","neelu@gmail.com","rahul@gmail.com","mahi@gmail.com","love@gmail.com"]}
df=ps.DataFrame(data3)
df["Username"]=df["email"].str.split("@").str[0]
print(df)

              email Username
0  neelam@gamil.com   neelam
1   neelu@gmail.com    neelu
2   rahul@gmail.com    rahul
3    mahi@gmail.com     mahi
4    love@gmail.com     love

In [4]:
# Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
# all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
# function should return a new DataFrame that contains only the selected rows.
# For example, if df contains the following values:
# A B C
# 0 3 5 1
# 1 8 2 7
# 2 6 9 4
# 3 2 3 5
# 4 9 1 2
# Your function should select the following rows: A B C
# 1 8 2 7
# 4 9 1 2
# The function should return a new DataFrame that contains only the selected rows.

In [6]:
import pandas as ps
data4={"A":[3,8,6,2,9], "B":[5,2,9,3,1],"C":[1,7,4,5,2]}
df=ps.DataFrame(data4)
(df["A"]>5) & (df["B"]<10)
df4=df[(df["A"]>5) & (df["B"]<10)]
print(df4)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [7]:
# Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
# median, and standard deviation of the values in the 'Values' column.

In [9]:
import pandas as pd
data5={"Values":[1,2,3,4,5,6,7,8,9,11,12,13,14,15,16,17,18,19,20,34,56,2,6,7,88,9,0,1,2,3,4,5,6,7,8,9]}
df=pd.DataFrame(data5)
df.describe()

          Values
count  36.000000
mean   12.416667
std    16.656830
min     0.000000
25%     4.000000
50%     7.500000
75%    14.250000
max    88.000000

In [10]:
# Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
# create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
# for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
# should include the current day.

In [14]:
import pandas as ps
data6={"Sales":[123,456,789,123,567,345,12,34,56,7],"Date":["01-02-2022","03-05-2022","14-06-2022","20-07-2022","22-11-2022","23-12-2023","23-12-2023","23-12-2023","23-12-2023","23-12-2023"]}
df=ps.DataFrame(data6)
df["MovingAverage"]=df.rolling(window=7).mean()
print(df)

   Sales        Date  MovingAverage
0    123  01-02-2022            NaN
1    456  03-05-2022            NaN
2    789  14-06-2022            NaN
3    123  20-07-2022            NaN
4    567  22-11-2022            NaN
5    345  23-12-2023            NaN
6     12  23-12-2023     345.000000
7     34  23-12-2023     332.285714
8     56  23-12-2023     275.142857
9      7  23-12-2023     163.428571

/tmp/ipykernel_102/2686654334.py:5: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['Date'], dtype='object')
  df["MovingAverage"]=df.rolling(window=7).mean()

In [ ]:
# Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
# column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
# Monday, Tuesday) corresponding to each date in the 'Date' column.
# For example, if df contains the following values:
# Date
# 0 2023-01-01
# 1 2023-01-02
# 2 2023-01-03
# 3 2023-01-04
# 4 2023-01-05
# Your function should create the following DataFrame:

# Date Weekday
# 0 2023-01-01 Sunday
# 1 2023-01-02 Monday
# 2 2023-01-03 Tuesday
# 3 2023-01-04 Wednesday
# 4 2023-01-05 Thursday
# The function should return the modified DataFrame.

In [15]:
import pandas as ps
data7={"Date":["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05","2023-01-06","2023-01-07"]}
df=ps.DataFrame(data7)
df["Weekday"]=["Sunday","Monday","Tuesday","Wednesday","Thursday","Friday","Saturday"]
print(df)

         Date    Weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday
5  2023-01-06     Friday
6  2023-01-07   Saturday

In [ ]:
# Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
# function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [16]:
import pandas as ps
data8={"Date":["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05","2023-01-06","2023-01-07","2023-01-08"
                      ,"2023-01-09","2023-01-10","2023-01-11","2023-01-12","2023-01-13","2023-01-14","2023-01-15","2023-01-16","2023-01-17","2023-01-18","2023-01-19",
              "2023-01-20","2023-01-21","2023-01-22","2023-01-23","2023-01-24","2023-01-25","2023-01-26","2023-01-27","2023-01-28","2023-01-29","2023-01-30","2023-01-31"]}
                      
df=ps.DataFrame(data8)
print(df)

          Date
0   2023-01-01
1   2023-01-02
2   2023-01-03
3   2023-01-04
4   2023-01-05
5   2023-01-06
6   2023-01-07
7   2023-01-08
8   2023-01-09
9   2023-01-10
10  2023-01-11
11  2023-01-12
12  2023-01-13
13  2023-01-14
14  2023-01-15
15  2023-01-16
16  2023-01-17
17  2023-01-18
18  2023-01-19
19  2023-01-20
20  2023-01-21
21  2023-01-22
22  2023-01-23
23  2023-01-24
24  2023-01-25
25  2023-01-26
26  2023-01-27
27  2023-01-28
28  2023-01-29
29  2023-01-30
30  2023-01-31

In [17]:
# Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
# be imported?

In [18]:
# 1. read_csv()
# This is one of the most crucial pandas methods in Python. read_csv() function helps read a comma-separated values (csv) file into a Pandas DataFrame.
# All you need to do is mention the path of the file you want it to read. 
# 2.read_html() 
# this is also most crucial pandas methods in python. read_html() function helps read hyper text markup languages  file into a pandas dataframe.
# 3)head()
# use for print by default first five columns  in a dataframe
#4) tail()
# use for print by default last five columns in dataframe

In [19]:
# Q6. Which function of pandas do we use to read an excel file?
# read_excel()

In [20]:
# Q1. List any five functions of the pandas library with execution.
# 1) read_csv()
# 2) head()
# 3) tail()
# 4) describe()
# 5) count()
import pandas as ps
df=pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [23]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [24]:
df.count(axis=1)

0      11
1      12
2      11
3      12
4      11
       ..
886    11
887    12
888    10
889    12
890    11
Length: 891, dtype: int64